Revit 2027 API
AnalyticalElement.IsValidSelector Method
 Indicates if the input selector is valid for the Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSelector(
	AnalyticalModelSelector selector
)
Public Function IsValidSelector (
	selector As AnalyticalModelSelector
) As Boolean
public:
bool IsValidSelector(
	AnalyticalModelSelector^ selector
)
member IsValidSelector :
        selector : AnalyticalModelSelector -> bool
Parameters
selector AnalyticalModelSelector
 Portion of the Analytical Element geometry.
Return Value
Boolean
 True if selector is valid for this Analytical Element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace